{
    "artist": "Agalloch",
    "album": "The Mantle",
    "release_date": "13/08/2002",
    "genre": "Folk Metal, avant-garde metal, black metal, post-metal",
    "cover": "https://upload.wikimedia.org/wikipedia/en/1/13/The_Mantle.jpg",
    "description" : "The Mantle is what many consider to be Agalloch's magnum opus, a great mix of black metal and folk instrumentation that brings it barely to life with bleak and desolate imagery.",
    "tracks": [
        {
            "title": "A Celebration For the Death of Man",
            "duration": "2:24",
            "track_number": 1
        },
        {
            "title": "In the Shadow of Our Pale Companion",
            "duration": "14:45",
            "track_number": 2
        },
        {
            "title": "Odal",
            "duration": "7:39",
            "track_number": 3
        },
        {
            "title": "I Am the Wooden Doors",
            "duration": "6:11",
            "track_number": 4
        },
        {
            "title": "The Lodge",
            "duration": "4:40",
            "track_number": 5
        },
        {
            "title": "You Were But a Ghost in My Arms",
            "duration": "9:14",
            "track_number": 6
        },
        {
            "title": "The Hawthorne Passage",
            "duration": "11:18",
            "track_number": 7
        },
        {
            "title": "... And The Great Cold Death of the Earth",
            "duration": "7:14",
            "track_number": 8
        },
        {
            "title": "A Desolation song",
            "duration": "5:08",
            "track_number": 9
        }
    ],
    "duration": "1:01:44",
    "label": "The End Records",
    "main_review": "Agalloch's 'The Mantle' isn't just a great and influential album; it's a transformative journey, one that showed the band breaking away from their early direction in favor of its intricate blend of atmospheric metal mixed with an unheard amount of folk, and post-rock canvas. Originally released in 2002, and met with surprise and mixed emotions, it continues to captivate listeners with its atmospheric depth and emotional resonance decades later. One could say, there is no other album like this, none other whose artwork and imagery are so intertwined, every image resonates so well with the music, it feels almost impeccable, as if pictures could tell the songs by themselves. The album allows the nostalgic warmth many crave, yet simultaneously creates a quite post-modern setting with the cold and haunting silver imagery: nature's majestic realm meets post-modern bitterness. From the haunting melodies of \"In the Shadow of Our Pale Companion\" to the almost hypnotic rhythms of \"I Am the Wooden Doors,\" the album's sonic palette is as diverse as the landscapes it evokes. Each track on \"The Mantle\" unfolds like a chapter in a dark, enchanting journey. Agalloch's signature blend of atmospheric (black) metal, deep folk instrumentation, and poetic lyricism creates a sense of introspection, an ethereal post-urban panorama. Ultimately, 'The Mantle' isn't just an album to be listened to; it's another experience to be felt. For fans of atmospheric & profound music, this album remains utterly essential... and utterly relevant.",
    "band_members": [
        "John Haughm - vocals, acoustic and electric guitars, drums, percussion, EBow, woodchimes, samples",
        "Don Anderson - acoustic, classical and electric guitars, piano",
        "Jason William Walton - bass guitar, noisescape"
    ],
    "other_reviews": [
        {
            "source": "Metal Archives",
            "rating": 90,
            "author": "Greiochain",
            "title": "The Woods Beckon You",
            "review": "An album that is almost impossible to escape when any discussion comes up about wintry metal, is Agalloch's sophomore work The Mantle. This band has been on my radar for multiple years now, but I never got around to checking them out. So this winter I made myself a promise: If we get snow, I will listen to The Mantle in its best suitable condition. And just as I thought my luck was running out, we got quite a lot of snow where I live, so I went for a walk, and finally gave the album a listen. While I still do not think it lives up to the level of one of the best albums of all time, set by the multiple online discussions where the album has come up, it is still an incredibly good record from start to finish. I knew very little about the album, other than it being a folk metal album made by a primarily black metal band, so I was also somewhat surprised by how the album sounds. While most folk metal is based around using elements of folk music to strengthen the metal aspect of the music, The Mantle does it the other way around, using black metal to strengthen the folk aspect of the album. A lot of the time, it is the acoustic guitar that takes the center of attention, with the droning black metal riffs in the background, adding texture on which the acoustic guitar leans against, adding a lot of the depth to the music. That is not to say there are no outright black metal parts, as there are plenty of those, the track \"I Am the Wooden Doors\" contains very few of these folky elements and is the closest to an entirely black metal song we get. The second track, \"In the Shadow of Our Pale Companion\", is definitely the strongest cut on here, and demonstrates how the folk elements utilize the blackened elements to further themselves the best. It feels a lot shorter than the 15 minutes it actually takes up, as it is constantly in movement, wandering through the snow covered woods as it progresses, and you feel as if you are on that journey as well while listening. We are also met with clean vocals quite early on, something which I did not anticipate the first time listening, but they are executed really well, along with the more standard black metal shrieks. It is an album that is full of beautiful moments, most of which are due to the clean vocals, but the instrumentation is also just enough on its own. \"The Hawthorne Passage\" is an 11 minute track that aside from some very sparse samples is entirely instrumental, and definitely features my favorite guitar playing on the entire album. The section after the first sample is heard almost eight minutes in, might just be my favorite part of The Mantle in general. The pacing is also done incredibly well, you really do not feel the more than an hour long runtime, as the record flows amazingly. It starts off with a short folky instrumental before the black metal elements are introduced on the next song, and the album keeps this pattern going, alternating between more folk-inspired instrumental cuts and more black metal-inspired songs. This keeps the album from becoming monotonous as with each new track, you are met with something different from the last, resulting in a very engaging listening experience. The best part of The Mantle however, is without a doubt the atmosphere, the post-ish black metal elements acting as the layer of snow coveringthe woods formed bythe folk aspects,andthe music perfectly guides you throughthe landscape.Thereisalso athick fogof melancholy permeatingtheforest,andalso making therecord quite an emotionally affecting experience.I wasvery surprisedbyhowgoodThe Mantle actuallyis.I regretnot having listenedtoitbefore,but nowthatI havefinally come aroundtodoinso,it willdefinitelynot be leavingmy rotation any time soon.If you have not heard it,donot be like me,andjust go do it already.Highlight tracks: Inthe Shadowof Our Pale Companion,the Hawthorne Passage,…andthe Great Cold Deathofthe Earth"
        },
        {
            "source": "Metal Archives",
            "rating": 100,
            "author": "BabySchraiberJesus",
            "title": "When metal transcends itself, and turns into art.",
            "review": "In my not-so-humble opinion, this is the finest album ever recorded. I've never heard anything even comparable to the power, the beauty, the sheer awe of this album. The first time I listened to it, I was nearly in tears. How these guys can make such amazing sounds from such simple ideas is beyond me. The music, in a lot of ways, is influenced by black metal, and european metal in general. I was quite surprised when I found out these guys are actually from Portland, Oregon. The vocals are pretty much equally black metal-esque and clean, though I think there's a bit more clean vocals. Actually, if there's anything wrong with this album it's Haughm's clean voice, which is... slightly odd. It takes some getting used to, definitely. However, I can' t say I'd like it any other way. It's very powerful. Haughm is also responsible for half of the guitar parts and, oddly, the percussion. I assume it means that he plays the drums, not that they have a drum machine, as the drums sound real enough. The drum lines fit the songs perfectly, even when they go into a bit of a marching band thing. A lot of the guitar work is 3/4 acoustic strumming, which is very repetitious, minimalistic, and simplistic, and that's what this album is about. Beauty through minimalism. I don't think any of the musicians would win awards for their technical ability, but the soloing on this album is beyond amazing. Simply beautiful. It's not fast, nor does it seem technical, it just really... tugs at your heart strings, so to speak. A lot of the soloing is acoustic, as well. When they decide to turn on the distortion you get some black metal-esque riffing, not in your face, but to add to the atmosphere. Very tasteful. The album is put together in an interesting way... with the exception of the last two songs, it alternates between instrumentals and normal songs. The instrumentals are very post-rockish, with one part building up for a while, then changing... the last instrumental, The Hawthorn Passage is one of my favorite songs ever, truly powerful, even without lyrics. On that note, I'm going to conclude with the lyrics. Normally I don't really care about lyrics, but when an album is perfect, it better have perfect lyrics, too, right? The words are well written, and flow together well, especially the first real song, \"In The Shadow of Our Pale Companion\", a song about Nature being the real God, aparently. Very, very powerful. \"Where is the god... has he fallen?\" This is probably not an album you will immediately understand if you don't know what you're looking for. But you must own it. It is incredible, it is beyond metal, it is beyond music."
        },
        {
            "source": "The Chronicles of Chaos",
            "rating": 95,
            "author": "Aaron McKay",
            "title": "Agalloch - _The Mantle_",
            "review": "Few albums come along that instill this kind of powerful inspiration upon a listener. Twist all the finest elements of Ulver's liquid madness with the serenity of Borknagar and the illusive nature of Agalloch begins to take shape. Darkness imbues every sunken pore on this hauntingly crevice sounding outpouring leaving you drained and fulfilled at the same time upon _The Mantle_'s conclusion. Words are a total failure when faced with describing Agalloch's gossamer depth. Believe me when I say the conceptual instrumentation on this CD opens before you like a hypnotic display from Pandora's box. Each and every one of the nine tracks play out on _The Mantle_ like passionate movements from a dream of emphatic longing and self-discovery. Nothing short of enrapture will suffice when overcome by the waves of heavy-hearted, nightshade-laced emotion _The Mantle_ delivers. Truly an offering to be taken in fully and -felt- rather than simply listened to. If this is Agalloch's sophomore effort, I'm unsure I will scarcely be able to comprehend what's to come... "
        },
        {
            "source": "AllMusic",
            "rating": 90,
            "author": "William York",
            "title": "The Mantle Review by William York",
            "review": "Agalloch's second album, The Mantle, is a leaps-and-bounds improvement over their first full-length, 1999's Pale Folklore. That wasn't a bad album, but it was hampered by a low-budget production job that didn't suit the sophisticated tone of the music. The improved production is the first thing that stands out here, evident in the more detailed arrangements, the classier guitar tones, and the fuller overall sound. That said, the music itself has also evolved and matured. Along with the Katatonia-inspired guitar work and grim, scratchy black metal vocals also present on Pale Folklore, a number of other sounds work their way into The Mantle, among them prominent acoustic guitar-strumming and cleanly sung vocals, Scandinavian-tinged folk guitar-picking (the middle breakdown during \"I Am the Wooden Doors\" is straight out of Ulver's bag), timpani percussion, and a few subtle electronic interludes. It is not just the range of sounds that's impressive, though, but rather how smoothly they are woven together, creating an album that flows from beginning to end, using its entire 68-minute running time to make its point without wearing out its welcome. Agalloch's biggest strength, much like the early work of Ulver and Katatonia, is their ability to create an epic type of listening experience without resorting to bombast or heavy-handedness, and that quality is plainly evident here. Factor in the excellent artwork and packaging (which features photos of the bandmembers looking very poised and European), and you have one of 2002's most accomplished and surprising metal-related albums."
        },
        {
            "source": "Loudwire",
            "rating": 90,
            "author": "Joe DiVita",
            "title": "The Mantle Review by Joe DiVita",
            "review": "Has there ever been a more fruitful fusion of Cascadian black metal and the dreary bliss of folk than Agalloch's 'The Mantle'? Like what Opeth did for death metal and prog on 'Blackwater Park,' the Oregon group did here, streamlining whimsically hypnotic dissonance through the calming experimentation of acoustic guitars, chimes and other instruments. The scales are kept in such a perfect balance as the hushed rasp and expressive clean aspect of John Haughm's voice act as guided meditation through this essential new millennium record."
        }
    ],
    "spotify_link": "https://open.spotify.com/album/7hOOJDRbH3we1P0iT2z1Hg",
    "apple_music_link": "https://music.apple.com/us/album/the-mantle/775506411",
    "youtube_link": "https://www.youtube.com/watch?v=INgo0xmYBeg"
}