
{
    "albums": [
            {
                "artist": "Archspire",
                "album": "Bleed the Future",
                "release_date": "29/10/2021",
                "genre": "Technical Death Metal",
                "cover": "https://www.metal-archives.com/images/9/6/8/4/968430.jpg?1653",
                "description" : "The G-force levels of velocity and dizzying technical proficiency reach seemingly impossible heights, defying the laws of physics and pushing human boundaries to the outer limits.",
                "tracks": [
                    {
                        "title": "Drone Corpse Aviator",
                        "duration": "3:46",
                        "track_number": 1
                    },
                    {
                        "title": "Golden Mouth of Ruin",
                        "duration": "4:05",
                        "track_number": 2
                    },
                    {
                        "title": "Abandon the Linear",
                        "duration": "4:35",
                        "track_number": 3
                    },
                    {
                        "title": "Bleed the Future",
                        "duration": "3:48",
                        "track_number": 4
                    },
                    {
                        "title": "Drain of Incarnation",
                        "duration": "4:19",
                        "track_number": 5
                    },
                    {
                        "title": "Acrid Canon",
                        "duration": "4:08",
                        "track_number": 6
                    },
                    {
                        "title": "Reverie on the Onyx",
                        "duration": "3:46",
                        "track_number": 7
                    },
                    {
                        "title": "A.U.M",
                        "duration": "3:03",
                        "track_number": 8
                    }
                ],
                "duration": "31:35",
                "label": "Season of Mist",
                "main_review": "It brings me no pleasure to inform you that the new Archspire record kind of sucks. \n\nWell, actually, it brings me a great deal of pleasure, because that is an outrageous lie, and the thought of you entertaining it for even a fraction of a second is riotous. Bleed the Future is not just good; it is, uncannily, exactly as good as I expected. And if you've heard Relentless Mutation, the band's now-classic 2017 record, you're expecting the same things form Bleed the Future that I was. You know it's going to be catchy; you know it's going to be dense; but most of all you know that it's going to be absurdly, criminally, impossibly fast. \n\n“Drone Corpse Aviator” immediately sets the pace with a tempo as rapid as its title is impossible to parse. A pilot who flies disassembled drones? A corpse at the controls of a drone? I couldn't tell you, but whomever or whatever it is, it's not staying in one place very long. Arriving with a spiraling lead and torrential drums, “Drone Corpse Aviator” opens Bleed the Future with everything Relentless Mutation used to revolutionize tech death. The breakneck pace, dexterous fretwork, and stop-on-a-dime coordination are what any band in the genre aspires to, but beyond the bare dominance are the particular details that make Archspire Archspire. Oli Peters' percussive growls function almost as an extension of Spencer Prewett's precise yet volatile drumming. Tobi Morelli, Dean Lamb, and bassist Jared Smith cruise across this jagged rhythmic matrix as if it were nothing but pause in its gaps to for delicate melodic interludes. As soon as the trio dance through one lull, they ricochet out again in a set of kaleidoscopic leads before closing the song with a slam-style reprisal of is main chromatic theme. \n\nIt gets better from there. Somehow, Bleed the Future manages to subtly ratchet intensity from “The Golden Mouth of Ruin” on. In the second track, a show-stopping transition steps down the pace from sixteenth notes to triplet eighths to eighths to triplet quarters in the five seconds before the groove hits. Not long after, “Bleed the Future” introduces another incredible rhythmic device, a synchronized two-hit hook that the band hammer home on downbeats of alternate eight- and seven-beat phrases. It's a commanding beginning that Archspire go on to completely outdo with the record's most addictive melody, so strong that the string players practice it in near-unison before it overwhelms them. The following “Drain of Incarnation” offers breathing room for only a moment, as its three-part contrapuntal piece quickly evolves into a hyperventilating tremolo riff. Across all of these addictive rhythms, the string players cascade intricate melodic leads and riffs that regularly switch between sweep-picking, tapping, pinch harmonics, and a half-dozen other demanding techniques. Every one of Bleed the Future's eight songs abounds with such technical feats, and Archspire's care in their arrangement ensures that you remember every note. \n\nWhat's not to like? Very little. The record is quite loud, and there are times when Dave Otero's mix and master feel cramped, like an octopus that's squeezed itself into a glass jar. From the outside, it's gleaming, but when different parts are pressed to the surface all over, it can be difficult to tell what you're looking at, a problem exacerbated when the eight-string guitar, six-string bass, and kick drum fight for low-end space. While this mix reinforces the record's increased intensity, it's simply not necessary, and I'd gratefully exchange it for the clarity of Relentless Mutation. But crucially, it doesn't make the record any less fun to listen to, evidenced by the fact that I've probably listened to it thirty or forty times. Each time Prewett's bell hit ushers in the career-topping speed of “A.U.M.” is just as stunning as the first. \n\nTechnical death metal is always a bit of a pissing contest, and for the last four years nobody has micturated something more magnificent than Relentless Mutation. The challenge Archspire faced with Bleed the Future was only to surpass their own high water mark, and, impossibly, they have. Bleed the Future makes Relentless Mutation seem just a tad lethargic, just a shade duller. And after listening to the record dozens of times over the past month, I keep coming back to it not to make notes or to consider it critically again, but just to witness it, finding something new to love every time. Archspire have outdone themselves, and it's an absolute joy to hear.",
                "review-origin": ["Angry Metal Guy", "https://www.angrymetalguy.com/archspire-bleed-the-future-review/"],
                "band_members": [
                    {
                        "name": "Oliver Rae Aleron",
                        "roles": ["Vocals"]
                    },
                    {
                        "name": "Spencer Prewett",
                        "roles": ["Drums"]
                    },
                    {
                        "name": "Tobi Morelli",
                        "roles": ["Guitar"]
                    },
                    {
                        "name": "Dean Lamb",
                        "roles": ["Guitar"]
                    },
                    {
                        "name": "Jared Smith",
                        "roles": ["Bass"]
                    }
                ],
                "other_reviews": [
                    {
                        "source": "Metal Archives",
                        "rating": 95,
                        "author": "TheOneNeverSeen",
                        "title": "Soaring Above the Apocalypse",
                        "review": "Following its awesome 2017 release \"Relentless Mutation\", Archspire conjured another piece of insane speed and epic catchy melodies with an attention-grabbing title \"Bleed the Future\". While retaining all that is good about its predecessor, the band's fourth full-length explores new heights of technicality and energy and is generally a way more amusing record. \n\nStarting off with a gradually intensifying rapid guitar accompanied by fervent drumming and bass, the album's first major single \"Drone Corpse Aviator\" instantly shows you what to expect of the album. Obviously, the song is incredibly fast (what else did you expect from Archspire?), has a catchy melodic riff, powerful thick bass and Oliver's mad rapping vocals. However, staying loyal to their style, the band diversifies the song structure to make it more entertaining, in this case through the use of a lengthy clean guitar passage before the madness joins the party again and then another one before Oliver bombards you with his \"DRONE CORPSE AVIATOR\". Just like the band's third full-length, \"Bleed the Future\" features multiple interesting elements to dilute its avalanche-like flow. The intro of \"Drain of Incarnation\" and the middle part of \"A. U. M.\", for example, feature immensely atmospheric melodies, both appropriate for their respective songs and great on their own. \n\nThe best song on the album is undoubtedly the title track. Starting off with the conventional Archspire madness, a solid headbangable riff and tempo changes all over the place, it suddenly turns to a highly catchy acoustic passage to then all of a sudden bash the listener with the same melody, but now with all the instruments and the vocals kicking it. This song is perfect in terms of its structure, possessing no weak elements and no excessive repetitions of the same notes. The rest of the album is also very consistent, even more so than \"Relentless Mutation\", since it has no tracks with less energy or less interesting melodies. I've enjoyed every single song on the album (to a different extent, of course, but still) and I can't even highlight the one I disliked the most, since there is no such song. Every song has at least one highly enjoyable part meaning the band has certainly mastered their songwriting after their previous full-length. \n\nSpeaking of the album's sound, I would say it's thicker and more powerful than on \"Relentless Mutation\". However, all most beloved elements of Archspire are still here. The constantly electrified drummer (there is no other way I can explain the speed of the band's drumming) keeps stealing the show with every blast beat, the guitarists... well, I don't think commentary is required here, their playing is simply beyond human understanding, Oliver's guttural rapping is solid as always. Speaking of the album's lyrics, they are written in more or less the same fashion, except this time the band seems to have tried (and Lamb's commentary I have heard on Nik Nocturnal's stream confirms that) to make their music catchier and their melodies - more easily memorable, which helps explain the vocally highlighted lines like \"DRONE CORPSE AVIATOR\", \"THEY WILL TAKE US NOW\" and \"THEY GROW, WE DIE\" that you just won't help but sing every time you relisten to the album. The only problem I have with those lines is that they are only really present in the two main singles and I would say having lines like that in \"Golden Mouth of Ruin\" or \"Reverie on the Onyx\" would be sweet. \n\nSo, while preserving the key traits of their style, Archspire keep expanding their boundaries and becoming even more successful at creating clean, energetic and atypical technical death metal, and the epic riffing and uplifting mood of \"Bleed the Future\" is a good example of that. I am very excited to hear what the band will have to offer in the bleeding future."
                    },
                    {
                        "source": "Metal Archives",
                        "rating": 100,
                        "author": "Greiochain",
                        "title": "Over the Top and Mindblowing Tech Death",
                        "review": "Archspire is a technical death metal band known for their inhuman technicality. Playing at lightning speeds while not turning into an incoherent mess, this band is a collective of some of the best musicians around. Bleed the Future is at the time of this review, their newest and best release. \n\nThe first thing that caught my attention when I found out about Archspire, was the album cover. It was some cool and interesting art, so I knew I had to give it a listen. I started off with \"Drain of Incarnation,\" which starts out with a slow, clean intro that quickly speeds up before kicking into an onslaught of pure technicality and speed. I was immediately blown away. I hadn't heard anything like that before. Everything was incredibly fast, especially the drums, but the thing that caught my interest the most was the vocals. I was familiar with other tech death at the time, but never had I heard the vocalist keep up with the instruments like that before. \n\nWhile I love technical death metal, one critique I have for a lot of it, especially newer, more modern tech death, is the fact that sometimes it feels like the music is technical just for the sake of being technical. Tech death is one of the most demanding genres experience-wise, so they're good with the instruments, but it just turns into a bunch of soulless wankery, which doesn't have any musical worth. This cannot be said for Archspire, because not only have they mastered their instruments, they are incredible songwriters too. The music almost feels human, and is kept interesting instead of just turning into a mess of technical prowess. \n\nThis is tech death in its purest form, just pure, undiluted speed and brutality. While this album is really heavy, it is actually a pretty accessible record, as the clean production doesn't make the music very abrasive. I've recommended Archspire to people just getting  into metal, not just death metal, and they've liked them after the first listen, so this is a pretty good place to start if you're looking to get into the more extreme subgenres of metal. \n\nOne of the things I like most about Archspire is definitely the lyrical universe. The dystopian sci-fi world created by the band is very interesting. The main antagonist being this organization known as the A.U.M. Bleed the Future is mostly focused on the creature known as the Boanet, which is also depicted on the album cover. This is a creature dreamt up by the vocalist that allows people to see and alter the future. The A.U.M. tries to harness the Boanet, but it eventually leads to a world-ending scenario. The lyrics fit the music perfectly, you wouldn't expect it to be about anything else. \n\nI've seen many people calling Archspire overproduced, but I don't think this is the case at all. The crystal clear, near perfect production fits the overly technical nature of the music, being the final touch that makes the band sound machine-like. The inhuman pace and complexity of the music wouldn't fit at all, had it not been for the production. \n\nBleed the Future is the purest form of technical death metal around, being overly complex and played at speeds that makes it hard to believe the band members are human, while not entering worthless wankery territory. Definitely a record worth checking out for anyone, especially those interested in getting into the extreme side of metal. \n\nHighlight tracks: Golden Mouth of Ruin, Bleed the Future, Acrid Canon"
                    },
                    {
                        "source": "Metal Injection",
                        "rating": 80,
                        "author": "Max Morin",
                        "title": "Album Review: ARCHSPIRE Bleed The Future",
                        "review": "Archspire have been around for over a decade, but it was 2017's Relentless Mutation that turned them into scene leaders. After gaining thousands of new fans (including Jason Momoa) and touring the planet, the Vancouver tech-death prodigies are ready to follow up their breakthrough album. Bleed The Future hits new levels of dizzying technicality mixed with the band's ability to make the most complicated riffs sound catchy. Whether you are a longtime Archspire listener or someone just getting into death metal, you really couldn't ask for more. \n\nAt the mechanical heart of Bleed The Future is Tom Morelli and Dean Lamb's 8-string guitar attack. Archspire's music might be a million miles removed from classic heavy metal but there are definitely shades of Randy Rhoads in the soaring guitar solos these two conjure up. Of course, it's all buried under an avalanche of blast beats and technical extremity that flies past at warp speed. Even when things do slow down for some tasteful clean passages, it's still full of the fretboard acrobatics we've come to expect. Archspire don't do minimalism. These guys play five notes where lesser bands could only manage two. \n\nThe speed at which Archspire attack on Bleed The Future is insane. We've all seen technical death metal bands play at inhuman tempos before, but this is something else. The 360 BPM title track is a miracle of precision, one where vocalist Oli Peters is spitting like extreme Busta Rhymes. Spencer Prewett has already singled himself out as one of the fastest drummers in modern metal. But when he kicks it up to 400 BPM on \"A.U.M\" he silences any remaining doubters. Prewett is dynamic and talented enough to keep his drums from devolving into one neverending blast beat. As he flails from one end of his kit to the other, we get the sense that this is the new equal to Gene Hoglan and Tomas Haake. \n\n\"Drone Corpse Aviator\" is a standout track on Bleed the Future. It has the potential to become a setlist staple (if the band's fingers don't snap off from playing before then). Under the pig squeals, gang vocals and explosive drumming is one of the best songs in Archspire's catalogue. But even with this as the standout, the whole album holds up. Archspire don't overstay their welcome and the end comes with you still wanting more. \n\nOne real champion here is producer Dave Otero. Bleed The Future avoids the production pitfalls that bring down so many great technical death metal bands: overloud drums, underutilized guitar and a compact, sterile sound. Hearing the way Jared Smith's bass arpeggios dance across the mix gives us some hope for death metal yet. \n\nCanada has produced some of the finest tech-death metal acts of all time. Cryptopsy, Beneath The Massacre, Beyond Creation and Gorguts have all left their mark, but Archspire seem to be the new leaders of the pack. They are leading bands like Tomb Mold and Æpoch into a Canadian death metal renaissance, one driven by websites like Bandcamp, where the underground is alive and well. Technical death metal couldn't ask for better leaders at this moment and we are lucky to have them. Rock on, guys. This is great. \n\nStay Tech."
                    },
                    {
                        "source": "Distorted Sound Mag",
                        "rating": 80,
                        "author": "Jessica Howkins",
                        "title": "ALBUM REVIEW: Bleed The Future - Archspire",
                        "review": "Forging their name based on new levels of extremity with each release, ARCHSPIRE have been consistent in their delivery of unrelenting extreme technical death metal. The Canadian quintet's technicality with playing and piecing together the forces they compose has meant nothing so far has fallen short of a barrage of blistering riffs, guttural vocals and blast-beats that only dreams are made of. Due to COVID-19, ARCHSPIRE's plans to tour in 2020 went scathed, which meant that with more time on their hands being in a global pandemic, their latest and fourth studio album, Bleed The Future, has had more pre-production than ever. Now, it's a test to see if that extra pre-production time has paid off and how it has refined their sound. \n\nOne of the many things that has made ARCHSPIRE stand out amongst their other technical death metal peers is their insane speed. Bleed The Future wastes no time in showing that they still have it in them to go one step further — opening track Drone Corpse Aviator is straight in like a throat-punch with how ridiculously fast it is. It feels impossible to imagine how one can play at this tempo, let alone four obviously talented musicians and one vocalist who can keep up at a rate that would make most pass out with lack of coming up for air. \n\nThe fascinating thing is, the quintet haven't lost their catchy riffs, solos and thick bass grooves in the midst of the chaos. Abandon The Linear is a shining example of how Jared Smith can play his instrument with such speed and yet show technique, melodic composure and flow in rhythm. The song in itself is one of the slower paced ones on the album, which isn't much slower than the speed of light it seems, but Smith's bass solo is a stream of funk-infused grooves that adds a layer that maintains your attention without a moments break. Whereas the fretwork from Dean Lamb and Tobi Morelli on Drain Of Incarnation is delicately intricate and emotive before it launches into one of the strongest songs on the album. It showcases the talents of the entire band regarding their chosen instruments and how they can still maintain the signature quick assault that has been noted in their career. \n\nWhen it comes to speed and death metal, even if it is tech-death, sometimes it's nice to have that moment to sit back and appreciate just what can go into writing a well-constructed song. Reverie On The Onyx features an extract of classical music and whilst it may not be as much of an assault as its predeceasing songs on the album, it's a fantastic highlight into just how much training and practicing these musicians, and plenty others have, to create a genre that isn't always considered as eloquent as it actually is. \n\nBleed The Future makes its 2017 predecessor, Relentless Mutation, seem like a walk in the park in comparison to what ARCHSPIRE have delivered this time around. The album has yet again surpassed and gone beyond any expectation that was initially there previously. It is unrelenting in how heavy it is, but again, the speed is on a whole new level this time around. COVID-19 may have thwarted the plans of ARCHSPIRE's 2020 tour, but, things happen for a reason — it gave this album the love and attention it deserved just by allowing more time to focus on the pre-production. Bleed The Future is unquestionably the most refined ARCHSPIRE have ever been, yet their most filthiest and neck-breaking work at the same time. The Canadian quintet have well and truly outdone themselves yet again this time around."
                    },
                    {
                        "source": "Metal Trenches",
                        "rating": 93,
                        "author": "Chris Dahlberg",
                        "title": "Archspire - Bleed the Future (Album Review)",
                        "review": "Technical death metal has been one of those sub-genres that remains very hit or miss for me, as while almost every band categorized as tech death has some level of impressive musicianship quite a few releases haven't had anything my brain could latch onto and remember days or even hours afterwards.  The best in the genre have been able to find that sweet spot between brain melting technical prowess and actual hooks that listeners remember consistently, capturing audiences of musicians and non-musicians alike.  Which brings us to Vancouver's Archspire, who have been able to achieve this with albums like The Lucid Collective and Relentless Mutation that brought rapid fire vocals, brutal fast paced yet downright fun riffs, all wrapped up in a concise package.  Four years have now passed since Relentless Mutation and the band has continued to refine their approach, with Bleed the Future now taking things to an entirely new level.  The shotgun vocals and blistering BPM have all been maintained, but there are more dips into melody and brutal death metal chugging which results in songwriting that is even more memorable. \n\nWhat has drawn me so much to Archspire and this newest album in particular is how they manage to be approachable and brain melting at the same time.  So often death metal that focuses on being the fastest or most technical ends up coming through as too virtuosic, to the point where you just stand there silently in awe and may or may not remember the details beyond how impressive the playing is.  But these guys bring fun and brutality in equal measure, where the transitions between grooves, chugs, and seemingly impossibly fast blast beats will have you bobbing your head the entire way through (and likely lead to maximum chaos in a live environment).  Compared to their previous three albums, Bleed the Future has a few more moments of pause where some hints of melody take over and there's more brutal death metal squealing and chugging than I remember.  These subtle shifts are integrated seamlessly into the blasting and blistering solos, and they go a long way in making many of these songs have an individual identity.  Archspire hasn't drastically changed anything they were doing before, but the subtle injection of some of these slower or mellower moments makes for stronger songwriting that uses every minute to keep listeners engaged.  Whether you focus on specific songs or just let the thirty-one minutes fly by on repeat, there are a ton of riffs, solos, and drum patterns that will keep you coming back. \n\nVocals sometimes end up being a weak point for tech death bands, as simply jamming your average growler or screamer on top of this super-fast instrumentation doesn't always click.  This is an area where Archspire has excelled from an early stage, as singer Oliver Rae Aleron uses what he calls shotgun vocals.  This allows him to hit all sorts of guttural growls and higher screams at a rapid fire, accurate cadence where every word is enunciated in a way that makes the lyrics easier to make out, a rarity for death metal vocals at this speed.  Every verse hits hard and is as brutal as you could possibly want, but again the cadence makes it downright fun and keeps everything high energy throughout.  It's reminiscent of early Slipknot vocals or hip-hop artists like Busdriver but run through a Cannibal Corpse and Suffocation filter, which may still prove to be an acquired taste for some but proved to be incredibly appealing for me. \n\nArchspire hasn't drastically overhauled their approach, instead making subtle tweaks that take their writing to a new level.  This is still as heavy, brutal, and technical as one could want, but it's also downright fun and the variation between tempos and occasional stylistic shifts make easier songs easier to pick out compared to the band's past discography.  I can also appreciate that not a minute is wasted as these guys really make a point to keep things concise and not stretch out their ideas like other bands in the genre.  Archspire has returned after four years stronger, faster, and definitely better, and I'm not sure if any other tech death in 2021 will surpass this high bar.  Bleed the Future is available from Season of Mist."
                    }
                ],
                "spotify_link": "https://open.spotify.com/album/5lWIRgkSy5WWOMrZ7xxygH?si=_c_zkrrKRoan26P--rViIQ",
                "apple_music_link": "https://music.apple.com/au/album/bleed-the-future/1574759854",
                "youtube_link": "https://music.youtube.com/playlist?list=OLAK5uy_nh4bwS7CMYvLpRW7TCbQXrw8rT-cdCGYY&si=o3cpKaO-NhLmgfNX",
                "wiki_link": "https://en.wikipedia.org/wiki/Bleed_the_Future"
            },
            {
                "date": "12/02/2026",
                "artist": "Agalloch",
                "album": "The Mantle",
                "release_date": "13/08/2002",
                "genre": "Folk Metal, avant-garde metal, black metal, post-metal",
                "cover": "https://upload.wikimedia.org/wikipedia/en/4/4b/TheMantle.jpg",
                "description": "The Mantle is what many consider to be Agalloch's magnum opus, a great mix of black metal and folk instrumentation that brings it barely to life with bleak and desolate imagery.",
                "tracks": [
                    {
                        "title": "A Celebration For the Death of Man",
                        "duration": "2:24",
                        "track_number": 1
                    },
                    {
                        "title": "In the Shadow of Our Pale Companion",
                        "duration": "14:45",
                        "track_number": 2
                    },
                    {
                        "title": "Odal",
                        "duration": "7:39",
                        "track_number": 3
                    },
                    {
                        "title": "I Am the Wooden Doors",
                        "duration": "6:11",
                        "track_number": 4
                    },
                    {
                        "title": "The Lodge",
                        "duration": "4:40",
                        "track_number": 5
                    },
                    {
                        "title": "You Were But a Ghost in My Arms",
                        "duration": "9:14",
                        "track_number": 6
                    },
                    {
                        "title": "The Hawthorne Passage",
                        "duration": "11:18",
                        "track_number": 7
                    },
                    {
                        "title": "... And The Great Cold Death of the Earth",
                        "duration": "7:14",
                        "track_number": 8
                    },
                    {
                        "title": "A Desolation song",
                        "duration": "5:08",
                        "track_number": 9
                    }
                ],
                "duration": "1:01:44",
                "label": "The End Records",
                "main_review": "Agalloch's 'The Mantle' isn't just a great and influential album; it's a transformative journey, one that showed the band breaking away from their early direction in favor of its intricate blend of atmospheric metal mixed with an unheard amount of folk, and post-rock canvas. Originally released in 2002, and met with surprise and mixed emotions, it continues to captivate listeners with its atmospheric depth and emotional resonance decades later. One could say, there is no other album like this, none other whose artwork and imagery are so intertwined, every image resonates so well with the music, it feels almost impeccable, as if pictures could tell the songs by themselves. The album allows the nostalgic warmth many crave, yet simultaneously creates a quite post-modern setting with the cold and haunting silver imagery: nature's majestic realm meets post-modern bitterness. From the haunting melodies of \"In the Shadow of Our Pale Companion\" to the almost hypnotic rhythms of \"I Am the Wooden Doors,\" the album's sonic palette is as diverse as the landscapes it evokes. Each track on \"The Mantle\" unfolds like a chapter in a dark, enchanting journey. Agalloch's signature blend of atmospheric (black) metal, deep folk instrumentation, and poetic lyricism creates a sense of introspection, an ethereal post-urban panorama. Ultimately, 'The Mantle' isn't just an album to be listened to; it's another experience to be felt. For fans of atmospheric & profound music, this album remains utterly essential... and utterly relevant.",
                "band_members": [
                    {
                        "name": "John Haughm",
                        "roles": ["vocals", "acoustic and electric guitars", "drums", "percussion", "EBow", "woodchimes", "samples"]
                    },
                    {
                        "name": "Don Anderson",
                        "roles": ["acoustic, classical and electric guitars", "piano"]
                    },
                    {
                        "name": "Jason William Walton",
                        "roles": ["bass guitar", "noisescape"]
                    }
                ],
                "other_reviews": [
                    {
                        "source": "Metal Archives",
                        "rating": 90,
                        "author": "Greiochain",
                        "title": "The Woods Beckon You",
                        "review": "An album that is almost impossible to escape when any discussion comes up about wintry metal, is Agalloch's sophomore work The Mantle. This band has been on my radar for multiple years now, but I never got around to checking them out. So this winter I made myself a promise: If we get snow, I will listen to The Mantle in its best suitable condition. And just as I thought my luck was running out, we got quite a lot of snow where I live, so I went for a walk, and finally gave the album a listen. While I still do not think it lives up to the level of one of the best albums of all time, set by the multiple online discussions where the album has come up, it is still an incredibly good record from start to finish. I knew very little about the album, other than it being a folk metal album made by a primarily black metal band, so I was also somewhat surprised by how the album sounds. While most folk metal is based around using elements of folk music to strengthen the metal aspect of the music, The Mantle does it the other way around, using black metal to strengthen the folk aspect of the album. A lot of the time, it is the acoustic guitar that takes the center of attention, with the droning black metal riffs in the background, adding texture on which the acoustic guitar leans against, adding a lot of the depth to the music. That is not to say there are no outright black metal parts, as there are plenty of those, the track \"I Am the Wooden Doors\" contains very few of these folky elements and is the closest to an entirely black metal song we get. The second track, \"In the Shadow of Our Pale Companion\", is definitely the strongest cut on here, and demonstrates how the folk elements utilize the blackened elements to further themselves the best. It feels a lot shorter than the 15 minutes it actually takes up, as it is constantly in movement, wandering through the snow covered woods as it progresses, and you feel as if you are on that journey as well while listening. We are also met with clean vocals quite early on, something which I did not anticipate the first time listening, but they are executed really well, along with the more standard black metal shrieks. It is an album that is full of beautiful moments, most of which are due to the clean vocals, but the instrumentation is also just enough on its own. \"The Hawthorne Passage\" is an 11 minute track that aside from some very sparse samples is entirely instrumental, and definitely features my favorite guitar playing on the entire album. The section after the first sample is heard almost eight minutes in, might just be my favorite part of The Mantle in general. The pacing is also done incredibly well, you really do not feel the more than an hour long runtime, as the record flows amazingly. It starts off with a short folky instrumental before the black metal elements are introduced on the next song, and the album keeps this pattern going, alternating between more folk-inspired instrumental cuts and more black metal-inspired songs. This keeps the album from becoming monotonous as with each new track, you are met with something different from the last, resulting in a very engaging listening experience. The best part of The Mantle however, is without a doubt the atmosphere, the post-ish black metal elements acting as the layer of snow coveringthe woods formed bythe folk aspects,andthe music perfectly guides you throughthe landscape.Thereisalso athick fogof melancholy permeatingtheforest,andalso making therecord quite an emotionally affecting experience.I wasvery surprisedbyhowgoodThe Mantle actuallyis.I regretnot having listenedtoitbefore,but nowthatI havefinally come aroundtodoinso,it willdefinitelynot be leavingmy rotation any time soon.If you have not heard it,donot be like me,andjust go do it already.Highlight tracks: Inthe Shadowof Our Pale Companion,the Hawthorne Passage,…andthe Great Cold Deathofthe Earth"
                    },
                    {
                        "source": "Metal Archives",
                        "rating": 100,
                        "author": "BabySchraiberJesus",
                        "title": "When metal transcends itself, and turns into art.",
                        "review": "In my not-so-humble opinion, this is the finest album ever recorded. I've never heard anything even comparable to the power, the beauty, the sheer awe of this album. The first time I listened to it, I was nearly in tears. How these guys can make such amazing sounds from such simple ideas is beyond me. The music, in a lot of ways, is influenced by black metal, and european metal in general. I was quite surprised when I found out these guys are actually from Portland, Oregon. The vocals are pretty much equally black metal-esque and clean, though I think there's a bit more clean vocals. Actually, if there's anything wrong with this album it's Haughm's clean voice, which is... slightly odd. It takes some getting used to, definitely. However, I can' t say I'd like it any other way. It's very powerful. Haughm is also responsible for half of the guitar parts and, oddly, the percussion. I assume it means that he plays the drums, not that they have a drum machine, as the drums sound real enough. The drum lines fit the songs perfectly, even when they go into a bit of a marching band thing. A lot of the guitar work is 3/4 acoustic strumming, which is very repetitious, minimalistic, and simplistic, and that's what this album is about. Beauty through minimalism. I don't think any of the musicians would win awards for their technical ability, but the soloing on this album is beyond amazing. Simply beautiful. It's not fast, nor does it seem technical, it just really... tugs at your heart strings, so to speak. A lot of the soloing is acoustic, as well. When they decide to turn on the distortion you get some black metal-esque riffing, not in your face, but to add to the atmosphere. Very tasteful. The album is put together in an interesting way... with the exception of the last two songs, it alternates between instrumentals and normal songs. The instrumentals are very post-rockish, with one part building up for a while, then changing... the last instrumental, The Hawthorn Passage is one of my favorite songs ever, truly powerful, even without lyrics. On that note, I'm going to conclude with the lyrics. Normally I don't really care about lyrics, but when an album is perfect, it better have perfect lyrics, too, right? The words are well written, and flow together well, especially the first real song, \"In The Shadow of Our Pale Companion\", a song about Nature being the real God, aparently. Very, very powerful. \"Where is the god... has he fallen?\" This is probably not an album you will immediately understand if you don't know what you're looking for. But you must own it. It is incredible, it is beyond metal, it is beyond music."
                    },
                    {
                        "source": "The Chronicles of Chaos",
                        "rating": 95,
                        "author": "Aaron McKay",
                        "title": "Agalloch - _The Mantle_",
                        "review": "Few albums come along that instill this kind of powerful inspiration upon a listener. Twist all the finest elements of Ulver's liquid madness with the serenity of Borknagar and the illusive nature of Agalloch begins to take shape. Darkness imbues every sunken pore on this hauntingly crevice sounding outpouring leaving you drained and fulfilled at the same time upon _The Mantle_'s conclusion. Words are a total failure when faced with describing Agalloch's gossamer depth. Believe me when I say the conceptual instrumentation on this CD opens before you like a hypnotic display from Pandora's box. Each and every one of the nine tracks play out on _The Mantle_ like passionate movements from a dream of emphatic longing and self-discovery. Nothing short of enrapture will suffice when overcome by the waves of heavy-hearted, nightshade-laced emotion _The Mantle_ delivers. Truly an offering to be taken in fully and -felt- rather than simply listened to. If this is Agalloch's sophomore effort, I'm unsure I will scarcely be able to comprehend what's to come... "
                    },
                    {
                        "source": "AllMusic",
                        "rating": 90,
                        "author": "William York",
                        "title": "The Mantle Review by William York",
                        "review": "Agalloch's second album, The Mantle, is a leaps-and-bounds improvement over their first full-length, 1999's Pale Folklore. That wasn't a bad album, but it was hampered by a low-budget production job that didn't suit the sophisticated tone of the music. The improved production is the first thing that stands out here, evident in the more detailed arrangements, the classier guitar tones, and the fuller overall sound. That said, the music itself has also evolved and matured. Along with the Katatonia-inspired guitar work and grim, scratchy black metal vocals also present on Pale Folklore, a number of other sounds work their way into The Mantle, among them prominent acoustic guitar-strumming and cleanly sung vocals, Scandinavian-tinged folk guitar-picking (the middle breakdown during \"I Am the Wooden Doors\" is straight out of Ulver's bag), timpani percussion, and a few subtle electronic interludes. It is not just the range of sounds that's impressive, though, but rather how smoothly they are woven together, creating an album that flows from beginning to end, using its entire 68-minute running time to make its point without wearing out its welcome. Agalloch's biggest strength, much like the early work of Ulver and Katatonia, is their ability to create an epic type of listening experience without resorting to bombast or heavy-handedness, and that quality is plainly evident here. Factor in the excellent artwork and packaging (which features photos of the bandmembers looking very poised and European), and you have one of 2002's most accomplished and surprising metal-related albums."
                    },
                    {
                        "source": "Loudwire",
                        "rating": 90,
                        "author": "Joe DiVita",
                        "title": "The Mantle Review by Joe DiVita",
                        "review": "Has there ever been a more fruitful fusion of Cascadian black metal and the dreary bliss of folk than Agalloch's 'The Mantle'? Like what Opeth did for death metal and prog on 'Blackwater Park,' the Oregon group did here, streamlining whimsically hypnotic dissonance through the calming experimentation of acoustic guitars, chimes and other instruments. The scales are kept in such a perfect balance as the hushed rasp and expressive clean aspect of John Haughm's voice act as guided meditation through this essential new millennium record."
                    }
                ],
                "spotify_link": "https://open.spotify.com/album/7hOOJDRbH3we1P0iT2z1Hg",
                "apple_music_link": "https://music.apple.com/us/album/the-mantle/775506411",
                "youtube_link": "https://www.youtube.com/watch?v=INgo0xmYBeg",
                "wiki_link": "https://en.wikipedia.org/wiki/The_Mantle"
            }
        ]
}
